ConfigFiles/Catalogs/ОбъектыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИерархии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИерархии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаМетаданныхВЕдЧисле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистраНакопления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегистровНакопления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСправкуВСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеОграниченийДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеПраво</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВводНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДвиженияДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДвиженияПоРегистру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКоманды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьМакеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПрава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредопределенныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСправочнаяИнформация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСсылкиИзОбъектовМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтандартныеКоманды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеразделенныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТестирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаОбъектаМетаданныхВЕдЧисле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривилегированныйРежимПриОтменеПроведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривилегированныйРежимПриПроведении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисутствуетВОсновномХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрПодчиненРегистратору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольДляВсехПрофилейПользователей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольСоздаетсяВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинонимДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереводПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСогласованияИзмененияВВетках</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласующийИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВводитсяНаОсновании</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеДвиженийПоРегистру</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидДвиженияРегистра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДвижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ВидыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыЗначенийРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияРеквизита</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/CommonModules/ОбменДаннымиПовтИспСППР/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет является ли данная информационная база
// подчиненным узлом РИБ с фильтрами
//
// Возвращаемое значение:
//  Булево - признак подчиненного узла РИБ с фильтрами
Функция ЭтоПодчиненныйУзелРИБСОтбором() Экспорт
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Возврат ГлавныйУзел <> Неопределено И ТипЗнч(ГлавныйУзел) = Тип("ПланОбменаСсылка.РИБСОтборами");
	
КонецФункции

// Возвращает текст запроса ПРО для использования его в обработчиках правил регистрации
//
// Возвращаемое значение:
//  Строка - Текст запроса ПРО
//
Функция СформироватьТекстЗапросаПравилРегистрации() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.РИБСОтборами КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.РИБСОтборами.Проекты КАК ПланОбменаТаблицаПроекты
	|		ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаТаблицаПроекты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.РИБСОтборами.ПапкиФайлов КАК ПланОбменаТаблицаПапкиФайлов
	|		ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаТаблицаПапкиФайлов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.РИБСОтборами.ГруппыДоступа КАК ПланОбменаТаблицаГруппыДоступа
	|		ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаТаблицаГруппыДоступа.Ссылка
	|ГДЕ
	|	НЕ ПланОбменаОсновнаяТаблица.Ссылка = &РИБСОтборамиЭтотУзел
	|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
	|	И (НЕ &СвойствоОбъекта_ФильтрПоПроектам
	|			ИЛИ (ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты))
	|	И (НЕ &СвойствоОбъекта_ФильтрПоПапкамФайлов
	|			ИЛИ (ПланОбменаТаблицаПапкиФайлов.ПапкаФайлов В (&СвойствоОбъекта_ПапкиФайлов)
	|				ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоПапкамФайлов))
	|	И (НЕ &СвойствоОбъекта_ФильтрПоГруппамДоступа
	|			ИЛИ (ПланОбменаТаблицаГруппыДоступа.ГруппаДоступа В (&СвойствоОбъекта_ГруппыДоступа)
	|				ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоГруппамДоступа))
	|	И (ПланОбменаОсновнаяТаблица.СинхронизироватьСообщения ИЛИ НЕ &СвойствоОбъекта_ЭтоСообщения)
	|	И (ПланОбменаОсновнаяТаблица.СинхронизироватьДополнительныеОтчетыИОбработки 
	|			ИЛИ НЕ &СвойствоОбъекта_ЭтоДополнительныеОтчетыИОбработки)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьЗадачи И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоЗадачи)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьОшибки И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоОшибки)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьРегламенты И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоРегламенты)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьЦелевыеЗадачи И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоЦелевыеЗадачи)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьФункциональнуюМодель И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоФункциональнаяМодель)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьТехническиеПроекты И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоТехническиеПроекты)
	|	И ((ПланОбменаТаблицаПроекты.СинхронизироватьИдеи И ПланОбменаТаблицаПроекты.Проект В (&СвойствоОбъекта_Проекты)) ИЛИ НЕ &СвойствоОбъекта_ЭтоИдеи)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса ПРО для использования его в обработчиках правил регистрации
//
// Параметры:
// ТипЗначенияОбъекта - Строка - Строковое представление типа данных
//
// Возвращаемое значение:
// Строка - Текст запроса для указанного типа данных
Функция СформироватьЗапросУзловДляОбъекта(ТипЗначенияОбъекта = "") Экспорт
	ТекстЗапроса = Неопределено;
	
	Если ТипЗначенияОбъекта = "СправочникОбъект.ПапкиФайлов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ИспользоватьОтборПоПапкамФайлов = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РИБСОтборамиПапкиФайлов.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.ПапкиФайлов КАК РИБСОтборамиПапкиФайлов
		|ГДЕ
		|	РИБСОтборамиПапкиФайлов.ПапкаФайлов = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ИспользоватьОтборПоПапкамФайлов";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ГруппыДоступа" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ИспользоватьОтборПоГруппамДоступа = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РИБСОтборамиГруппыДоступа.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.ГруппыДоступа КАК РИБСОтборамиГруппыДоступа
		|ГДЕ
		|	РИБСОтборамиГруппыДоступа.ГруппаДоступа = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиГруппыДоступа.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиГруппыДоступа.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиГруппыДоступа.Ссылка.ИспользоватьОтборПоГруппамДоступа";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ДополнительныеОтчетыИОбработки"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.ПользовательскиеНастройкиДоступаКОбработкам" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.СинхронизироватьДополнительныеОтчетыИОбработки";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Пользователи" 
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.НастройкиВариантовОтчетов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И НЕ РИБСОтборами.ИспользоватьСкрытиеИменПользователей
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПользователи.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Пользователи КАК РИБСОтборамиПользователи
		|ГДЕ
		|	РИБСОтборамиПользователи.Пользователь = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПользователи.Ссылка.ИспользоватьСкрытиеИменПользователей
		|	И РИБСОтборамиПользователи.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПользователи.Ссылка.ЭтотУзел = ЛОЖЬ";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ГруппыПользователей" Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И НЕ РИБСОтборами.ИспользоватьСкрытиеИменПользователей";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Проекты" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Регламенты" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.СинхронизироватьРегламенты
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли  ТипЗначенияОбъекта = "СправочникОбъект.ЦелевыеЗадачи" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.СинхронизироватьЦелевыеЗадачи
		|	И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиРазделыПроектов.РазделПроекта В (&СвойствоОбъекта_МассивРазделов)
		|	И РИБСОтборамиПроекты.СинхронизироватьЦелевыеЗадачи
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Ошибки" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиРазделыПроектов.РазделПроекта В (&СвойствоОбъекта_МассивРазделов)
		|	И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Идеи" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиРазделыПроектов.РазделПроекта В (&СвойствоОбъекта_МассивРазделов)
		|	И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.РазделыПроекта" Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_СсылкаПроект
		|	И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|";
		Возврат ТекстЗапроса;

	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ВерсииПроекта"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ВидыДоступа"
		Или ТипЗначенияОбъекта = "СправочникОбъект.Подсистемы"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ОбъектыМетаданных"
		Или ТипЗначенияОбъекта = "СправочникОбъект.МестаИсправленияОшибок"
		Или ТипЗначенияОбъекта = "СправочникОбъект.Ветки" 
		Или ТипЗначенияОбъекта = "СправочникОбъект.НастройкиЗапускаТестирования" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ТехническиеПроекты" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|	И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И РИБСОтборамиРазделыПроектов.РазделПроекта В (&СвойствоОбъекта_МассивРазделов)
		|	И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|	И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|		ИЛИ &СвойствоОбъекта_Публикуется)
		|";
		Возврат ТекстЗапроса;
	ИначеЕсли  ТипЗначенияОбъекта = "СправочникОбъект.Процессы"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ПрофилиПользователей" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.WebСервисыСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.WSСсылкиСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ПакетыXDTOСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ГруппыКомандСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.КритерииОтбораСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ОбщиеМодулиСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ОбщиеКомандыСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ОбщиеМакетыСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ОбщиеРеквизитыСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ПодпискиНаСобытияСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ПоследовательностиСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.РегламентныеЗаданияСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ФункциональныеОпцииСвойства"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ФормыОбъектовМетаданных"
		Или ТипЗначенияОбъекта = "СправочникОбъект.КомандыОбъектовМетаданных"
		Или ТипЗначенияОбъекта = "СправочникОбъект.МакетыОбъектовМетаданных"
		Или ТипЗначенияОбъекта = "СправочникОбъект.РеквизитыОбъектовМетаданных"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ПредопределенныеДанные" 
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.ПраваДоступаКОбъектамМетаданных" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОбъектыМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|	И ОбъектыМетаданных.Владелец = РИБСОтборамиПроекты.Проект
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ШагиПроцесса" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	Справочник.Процессы КАК Процессы,
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Процессы.Ссылка = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|	И Процессы.Владелец = РИБСОтборамиПроекты.Проект
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.СборкиВерсии" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	Справочник.ВерсииПроекта КАК ВерсииПроекта,
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	ВерсииПроекта.Ссылка = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВерсииПроекта.Владелец = РИБСОтборамиПроекты.Проект
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ЭлементыСправки" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОбъектыМетаданных.Владелец КАК Владелец,
		|   Ложь КАК ЭтоФункциональнаяМодель
		|ПОМЕСТИТЬ ВладелецОбъекта
		|ИЗ
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|ГДЕ
		|	ОбъектыМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Подсистемы.Владелец,
		|	Ложь
		|ИЗ
		|	Справочник.Подсистемы КАК Подсистемы
		|ГДЕ
		|	Подсистемы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыМетаданных.Владелец,
		|	Ложь
		|ИЗ
		|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|		ПО ФормыОбъектовМетаданных.Владелец = ОбъектыМетаданных.Ссылка
		|ГДЕ
		|	ФормыОбъектовМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ВладелецОбъекта КАК ВладелецОбъекта
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВладелецОбъекта.Владелец = РИБСОтборамиПроекты.Проект
		|	И (ВладелецОбъекта.ЭтоФункциональнаяМодель
		|				И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|			ИЛИ НЕ РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель)
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.НаследованиеНастроекПравОбъектов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ИспользоватьОтборПоПапкамФайлов = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РИБСОтборамиПапкиФайлов.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.ПапкиФайлов КАК РИБСОтборамиПапкиФайлов
		|ГДЕ
		|	РИБСОтборамиПапкиФайлов.ПапкаФайлов = &СвойствоОбъекта_Родитель
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ИспользоватьОтборПоПапкамФайлов = ИСТИНА";
		Возврат ТекстЗапроса;

	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.ИзмененияВВетках" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	Справочник.Ветки КАК Ветки,
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	Ветки.Ссылка = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Ветки.Владелец = РИБСОтборамиПроекты.Проект
		|";
		Возврат ТекстЗапроса;
	
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.ВерсииОбъектов"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.ДатыИзмененияОбъектов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ФормыОбъектовМетаданных.Владелец КАК Ссылка,
		|	NULL КАК ЭтоФункциональнаяМодель,
		|	NULL КАК ЭтоОшибки,
		|	NULL КАК ЭтоТехническиеПроекты
		|ПОМЕСТИТЬ ВладелецОбъектПоСсылке
		|ИЗ
		|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
		|ГДЕ
		|	ФормыОбъектовМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыДоступа.Владелец,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ВидыДоступа КАК ВидыДоступа
		|ГДЕ
		|	ВидыДоступа.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыМетаданных.Владелец,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|ГДЕ
		|	ОбъектыМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ошибки.Владелец,
		|	NULL,
		|	ИСТИНА,
		|	NULL
		|ИЗ
		|	Справочник.Ошибки КАК Ошибки
		|ГДЕ
		|	Ошибки.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Подсистемы.Владелец,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Подсистемы КАК Подсистемы
		|ГДЕ
		|	Подсистемы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрофилиПользователей.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ПрофилиПользователей КАК ПрофилиПользователей
		|ГДЕ
		|	ПрофилиПользователей.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Процессы.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТехническиеПроекты.Владелец,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ТехническиеПроекты КАК ТехническиеПроекты
		|ГДЕ
		|	ТехническиеПроекты.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Идеи.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Идеи КАК Идеи
		|ГДЕ
		|	Идеи.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Процессы.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ШагиПроцесса КАК ШагиПроцесса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы КАК Процессы
		|		ПО ШагиПроцесса.Владелец = Процессы.Ссылка
		|ГДЕ
		|	ШагиПроцесса.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ВладелецОбъектПоСсылке КАК ВладелецОбъектПоСсылке
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = ВладелецОбъектПоСсылке.Ссылка
		|	И (ВладелецОбъектПоСсылке.ЭтоФункциональнаяМодель
		|				И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|			ИЛИ ВладелецОбъектПоСсылке.ЭтоОшибки
		|				И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|			ИЛИ ВладелецОбъектПоСсылке.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|			ИЛИ НЕ(ВладелецОбъектПоСсылке.ЭтоФункциональнаяМодель
		|					ИЛИ ВладелецОбъектПоСсылке.ЭтоОшибки
		|					ИЛИ ВладелецОбъектПоСсылке.ЭтоТехническиеПроекты))
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.КонтрольИзменений" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ФормыОбъектовМетаданных.Владелец КАК Ссылка,
		|	NULL КАК ЭтоФункциональнаяМодель
		|ПОМЕСТИТЬ ВладелецОбъектПоСсылке
		|ИЗ
		|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
		|ГДЕ
		|	ФормыОбъектовМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыДоступа.Владелец,
		|	NULL
		|ИЗ
		|	Справочник.ВидыДоступа КАК ВидыДоступа
		|ГДЕ
		|	ВидыДоступа.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|
		|ВЫБРАТЬ
		|	ОбъектыМетаданных.Владелец,
		|	NULL
		|ИЗ
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|ГДЕ
		|	ОбъектыМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Подсистемы.Владелец,
		|	NULL
		|ИЗ
		|	Справочник.Подсистемы КАК Подсистемы
		|ГДЕ
		|	Подсистемы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрофилиПользователей.Владелец,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ПрофилиПользователей КАК ПрофилиПользователей
		|ГДЕ
		|	ПрофилиПользователей.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Процессы.Владелец,
		|	ИСТИНА
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШагиПроцесса.Владелец,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ШагиПроцесса КАК ШагиПроцесса
		|ГДЕ
		|	ШагиПроцесса.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ВладелецОбъектПоСсылке КАК ВладелецОбъектПоСсылке
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ВладелецОбъектПоСсылке.Ссылка = РИБСОтборамиПроекты.Проект
		|	И (ВладелецОбъектПоСсылке.ЭтоФункциональнаяМодель
		|				И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|			ИЛИ НЕ ВладелецОбъектПоСсылке.ЭтоФункциональнаяМодель)
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.РезультатыПроверкиОбъектов"  Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОбъектыМетаданных.Владелец КАК Владелец,
		|	NULL КАК ЭтоФункциональнаяМодель,
		|	NULL КАК ЭтоТехническиеПроекты
		|ПОМЕСТИТЬ ВладелецОбъекта
		|ИЗ
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|ГДЕ
		|	ОбъектыМетаданных.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрофилиПользователей.Владелец,
		|	ИСТИНА,
		|	NULL
		|ИЗ
		|	Справочник.ПрофилиПользователей КАК ПрофилиПользователей
		|ГДЕ
		|	ПрофилиПользователей.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Процессы.Владелец,
		|	ИСТИНА,
		|	NULL
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТехническиеПроекты.Владелец,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ТехническиеПроекты КАК ТехническиеПроекты
		|ГДЕ
		|	ТехническиеПроекты.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыДоступа.Владелец,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ВидыДоступа КАК ВидыДоступа
		|ГДЕ
		|	ВидыДоступа.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ВладелецОбъекта КАК ВладелецОбъекта
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.СинхронизироватьРезультатыПроверкиОбъектов = ИСТИНА
		|	И ВладелецОбъекта.Владелец = РИБСОтборамиПроекты.Проект
		|	И (ВладелецОбъекта.ЭтоФункциональнаяМодель
		|				И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|			ИЛИ ВладелецОбъекта.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|			ИЛИ НЕ(ВладелецОбъекта.ЭтоФункциональнаяМодель
		|					ИЛИ ВладелецОбъекта.ЭтоТехническиеПроекты))
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.Файлы"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ВерсииФайлов"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.НаличиеФайлов" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Ссылка КАК Проект,
		|	NULL КАК ЭтоОшибки,
		|	NULL КАК ЭтоРегламенты,
		|	NULL КАК ЭтоТехническиеПроекты,
		|	NULL КАК ЭтоИдеи
		|ПОМЕСТИТЬ ПроектВладелец
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ  Проекты.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ошибки.Ссылка,
		|	Ошибки.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Ошибки КАК Ошибки
		|ГДЕ Ошибки.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Регламенты.Ссылка,
		|	Регламенты.Владелец,
		|	NULL,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Регламенты КАК Регламенты
		|ГДЕ Регламенты.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТехническиеПроекты.Ссылка,
		|	ТехническиеПроекты.Владелец,
		|	NULL,
		|	NULL,
		|	ИСТИНА,
		|	NULL
		|ИЗ
		|	Справочник.ТехническиеПроекты КАК ТехническиеПроекты
		|ГДЕ ТехническиеПроекты.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Идеи.Ссылка,
		|	Идеи.Владелец,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	Справочник.Идеи КАК Идеи
		|ГДЕ Идеи.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Процессы.Ссылка,
		|	Процессы.Владелец,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ Процессы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Проект, Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПапкиФайлов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПапкаФайловВладелец
		|ИЗ
		|	Справочник.ПапкиФайлов КАК ПапкиФайлов
		|ГДЕ ПапкиФайлов.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта КАК Ссылка,
		|	ИСТИНА КАК ЭтоИдеи,
		|	ЛОЖЬ КАК ЭтоОшибки,
		|	ЛОЖЬ КАК ЭтоТехническиеПроекты
		|ПОМЕСТИТЬ РазделыПроекта
		|ИЗ
		|	Справочник.Идеи
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ Справочник.Идеи.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.Ошибки
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ Справочник.Ошибки.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ТехническиеПроекты
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ Справочник.ТехническиеПроекты.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ПроектВладелец КАК ПроектВладелец
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПроектВладелец.Проект = РИБСОтборамиПроекты.Проект
		|	И (ПроектВладелец.ЭтоРегламенты
		|				И РИБСОтборамиПроекты.СинхронизироватьРегламенты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеРегламенты ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоОшибки
		|				И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоИдеи
		|				И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ (НЕ(ПроектВладелец.ЭтоОшибки
		|					ИЛИ ПроектВладелец.ЭтоРегламенты
		|					ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|					ИЛИ ПроектВладелец.ЭтоИдеи)
		|				)
		|	И ( (ПроектВладелец.ЭтоОшибки
		|		ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|		ИЛИ ПроектВладелец.ЭтоИдеи)
		|		И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|		ИЛИ НЕ (ПроектВладелец.ЭтоОшибки
		|		ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|		ИЛИ ПроектВладелец.ЭтоИдеи)
		|		))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПроектВладелец КАК ПроектВладелец,
		|	РазделыПроекта КАК РазделыПроекта,
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПроектВладелец.Проект = РИБСОтборамиПроекты.Проект
		|	И РазделыПроекта.Ссылка = РИБСОтборамиРазделыПроектов.РазделПроекта
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И (ПроектВладелец.ЭтоРегламенты
		|				И РИБСОтборамиПроекты.СинхронизироватьРегламенты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеРегламенты ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоОшибки
		|				И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоИдеи
		|				И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ (НЕ(ПроектВладелец.ЭтоОшибки
		|					ИЛИ ПроектВладелец.ЭтоРегламенты
		|					ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|					ИЛИ ПроектВладелец.ЭтоИдеи)
		|				))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПапкиФайлов.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.ПапкиФайлов КАК РИБСОтборамиПапкиФайлов,
		|	ПапкаФайловВладелец КАК ПапкаФайловВладелец
		|ГДЕ
		|	РИБСОтборамиПапкиФайлов.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПапкаФайловВладелец.Ссылка = РИБСОтборамиПапкиФайлов.ПапкаФайлов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами,
		|	ПапкаФайловВладелец КАК ПапкаФайловВладелец
		|ГДЕ
		|	РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ИспользоватьОтборПоПапкамФайлов = ЛОЖЬ";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.КодировкиФайлов"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.ДвоичныеДанныеФайлов"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.СведенияОФайлах" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ВладелецФайла КАК ВладелецФайла
		|ПОМЕСТИТЬ Файл
		|ИЗ
		|	Справочник.ВерсииФайлов КАК ВерсииФайлов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО ВерсииФайлов.Владелец = Файлы.Ссылка
		|ГДЕ
		|	ВерсииФайлов.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Файлы.Ссылка,
		|	Файлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &СвойствоОбъекта_Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВладелецФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Ссылка КАК Проект,
		|	NULL КАК ЭтоОшибки,
		|	NULL КАК ЭтоРегламенты,
		|	NULL КАК ЭтоТехническиеПроекты,
		|	NULL КАК ЭтоИдеи
		|ПОМЕСТИТЬ ПроектВладелец
		|ИЗ
		|	Файл КАК Файл
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО Файл.ВладелецФайла = Проекты.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ошибки.Ссылка,
		|	Ошибки.Владелец,
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Ошибки КАК Ошибки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Файл КАК Файл
		|		ПО Ошибки.Ссылка = Файл.ВладелецФайла
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Регламенты.Ссылка,
		|	Регламенты.Владелец,
		|	NULL,
		|	ИСТИНА,
		|	NULL,
		|	NULL
		|ИЗ
		|	Файл КАК Файл
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Регламенты КАК Регламенты
		|		ПО Файл.ВладелецФайла = Регламенты.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТехническиеПроекты.Ссылка,
		|	ТехническиеПроекты.Владелец,
		|	NULL,
		|	NULL,
		|	ИСТИНА,
		|	NULL
		|ИЗ
		|	Файл КАК Файл
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
		|		ПО Файл.ВладелецФайла = ТехническиеПроекты.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Идеи.Ссылка,
		|	Идеи.Владелец,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	Файл КАК Файл
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Идеи КАК Идеи
		|		ПО Файл.ВладелецФайла = Идеи.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Проект, Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПапкиФайлов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПапкаФайловВладелец
		|ИЗ
		|	Файл КАК Файл
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПапкиФайлов КАК ПапкиФайлов
		|		ПО Файл.ВладелецФайла = ПапкиФайлов.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта КАК Ссылка,
		|	ИСТИНА КАК ЭтоИдеи,
		|	ЛОЖЬ КАК ЭтоОшибки,
		|	ЛОЖЬ КАК ЭтоТехническиеПроекты
		|ПОМЕСТИТЬ РазделыПроекта
		|ИЗ
		|	Справочник.Идеи
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ Справочник.Идеи.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.Ошибки
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ Справочник.Ошибки.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделПроекта,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	Справочник.ТехническиеПроекты
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И РазделПроекта <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Раздел,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ Справочник.ТехническиеПроекты.РазделыПроекта
		|ГДЕ Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Из ПроектВладелец)
		|	И Раздел <> ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты,
		|	ПроектВладелец КАК ПроектВладелец
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПроектВладелец.Проект = РИБСОтборамиПроекты.Проект
		|	И (ПроектВладелец.ЭтоРегламенты
		|				И РИБСОтборамиПроекты.СинхронизироватьРегламенты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеРегламенты ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоОшибки
		|				И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоИдеи
		|				И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ (НЕ(ПроектВладелец.ЭтоОшибки
		|					ИЛИ ПроектВладелец.ЭтоРегламенты
		|					ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|					ИЛИ ПроектВладелец.ЭтоИдеи)
		|				))
		|	И ( (ПроектВладелец.ЭтоОшибки
		|		ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|		ИЛИ ПроектВладелец.ЭтоИдеи)
		|		И НЕ РИБСОтборамиПроекты.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|		ИЛИ НЕ (ПроектВладелец.ЭтоОшибки
		|		ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|		ИЛИ ПроектВладелец.ЭтоИдеи)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПроектВладелец КАК ПроектВладелец,
		|	РазделыПроекта КАК РазделыПроекта,
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ПланОбмена.РИБСОтборами.РазделыПроектов КАК РИБСОтборамиРазделыПроектов
		|ПО РИБСОтборамиПроекты.Ссылка = РИБСОтборамиРазделыПроектов.Ссылка
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПроектВладелец.Проект = РИБСОтборамиПроекты.Проект
		|	И РазделыПроекта.Ссылка = РИБСОтборамиРазделыПроектов.РазделПроекта
		|	И РИБСОтборамиРазделыПроектов.Ссылка.ИспользоватьОтборПоРазделамПроектов
		|	И (ПроектВладелец.ЭтоРегламенты
		|				И РИБСОтборамиПроекты.СинхронизироватьРегламенты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеРегламенты ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоОшибки
		|				И РИБСОтборамиПроекты.СинхронизироватьОшибки
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеОшибки
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|				И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеТехническиеПроекты
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ ПроектВладелец.ЭтоИдеи
		|				И РИБСОтборамиПроекты.СинхронизироватьИдеи
		|				И (НЕ РИБСОтборамиПроекты.ТолькоПубликуемыеИдеи
		|				ИЛИ &СвойствоОбъекта_Публикуется)
		|			ИЛИ (НЕ(ПроектВладелец.ЭтоОшибки
		|					ИЛИ ПроектВладелец.ЭтоРегламенты
		|					ИЛИ ПроектВладелец.ЭтоТехническиеПроекты
		|					ИЛИ ПроектВладелец.ЭтоИдеи
		|				)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПапкиФайлов.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.ПапкиФайлов КАК РИБСОтборамиПапкиФайлов,
		|	ПапкаФайловВладелец КАК ПапкаФайловВладелец
		|ГДЕ
		|	РИБСОтборамиПапкиФайлов.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И ПапкаФайловВладелец.Ссылка = РИБСОтборамиПапкиФайлов.ПапкаФайлов
		|	И РИБСОтборамиПапкиФайлов.Ссылка.ИспользоватьОтборПоПапкамФайлов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами,
		|	ПапкаФайловВладелец КАК ПапкаФайловВладелец
		|ГДЕ
		|	РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ИспользоватьОтборПоПапкамФайлов = ЛОЖЬ";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.НаборыДополнительныхРеквизитовИСведений"
		Или ТипЗначенияОбъекта = "ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"
		Или ТипЗначенияОбъекта = "СправочникОбъект.ЗначенияСвойствОбъектов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (РИБСОтборамиПроекты.Проект.НаборСвойств = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляВерсийПроекта = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляВеток = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляЗадачиПроцесса = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляИдей = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляКомандОбъектовМетаданных = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляМакетовОбъектовМетаданных = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляНастроекЗапускаПроцессовВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляНастроекЗапускаПроцессовНеВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляНастроекЗапускаСценариевВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляНастроекЗапускаСценариевНеВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляОбъектовМетаданных = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляОшибок = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляПодсистем = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляПроцессовВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляПроцессовНеВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляРазделовПроекта = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляРеквизитовОбъектовМетаданных = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляСборокВерсий = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляСценариевРаботыПользователейВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляСценариевРаботыПользователейНеВыгружаемый = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляТехническихПроектов = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляФормОбъектовМетаданных = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляФункцийСистемы = &СвойствоОбъекта_Ссылка
		|		ИЛИ РИБСОтборамиПроекты.Проект.НаборСвойствДляЦелевыхЗадач = &СвойствоОбъекта_Ссылка
		|	)
		|";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "ДокументОбъект.УчетВремени" Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.СинхронизироватьДанныеУчетаВремени
		|	И РИБСОтборамиПроекты.Проект В (&СвойствоОбъекта_Проекты)
		|";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "РегистрНакопленияЗапись.УчетВремени" Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|	И РИБСОтборамиПроекты.Ссылка.СинхронизироватьДанныеУчетаВремени
		|";
		Возврат ТекстЗапроса;
	ИначеЕсли ТипЗначенияОбъекта = "РегистрСведенийЗапись.КалендариПользователей" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	Ошибки.Владелец КАК Проект
		|ПОМЕСТИТЬ ПроектВладелец
		|ИЗ
		|	Справочник.Ошибки КАК Ошибки
		|ГДЕ Ошибки.Ссылка = &СвойствоОбъекта_Ошибка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Проекты.Ссылка
		|ИЗ Справочник.Проекты КАК Проекты
		|ГДЕ Проекты.Ссылка = &СвойствоОбъекта_Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Проекты.Ссылка
		|ИЗ Справочник.Проекты КАК Проекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДеятельности КАК ВидыДеятельности
		|ГДЕ ВидыДеятельности.Ссылка = &СвойствоОбъекта_ВидДеятельности
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроектВладелец КАК ПроектВладелец
		|ПО РИБСОтборамиПроекты.Проект = ПроектВладелец.Проект
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.СинхронизироватьКалендари
		|";
	ИначеЕсли  ТипЗначенияОбъекта = "СправочникОбъект.ФункцииСистемы" Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПроекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
		|ГДЕ
		|	РИБСОтборамиПроекты.Ссылка.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборамиПроекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПроекты.СинхронизироватьФункциональнуюМодель
		|	И РИБСОтборамиПроекты.Проект = &СвойствоОбъекта_Ссылка
		|";
		Возврат ТекстЗапроса;
		
	ИначеЕсли ТипЗначенияОбъекта = "СправочникОбъект.ВидыПланов"
		Или ТипЗначенияОбъекта = "РегистрСведенийЗапись.ЗаписиПлана" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РИБСОтборами.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами КАК РИБСОтборами
		|ГДЕ
		|	РИБСОтборами.ЭтотУзел = ЛОЖЬ
		|	И РИБСОтборами.ПометкаУдаления = ЛОЖЬ
		|	И НЕ РИБСОтборами.ИспользоватьСкрытиеИменПользователей
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РИБСОтборамиПользователи.Ссылка
		|ИЗ
		|	ПланОбмена.РИБСОтборами.Пользователи КАК РИБСОтборамиПользователи
		|ГДЕ
		|	РИБСОтборамиПользователи.Пользователь В (&СвойствоОбъекта_Пользователи)
		|	И РИБСОтборамиПользователи.Ссылка.ИспользоватьСкрытиеИменПользователей
		|	И РИБСОтборамиПользователи.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РИБСОтборамиПользователи.Ссылка.ЭтотУзел = ЛОЖЬ";
		Возврат ТекстЗапроса;
	
	КонецЕсли;
	
	Возврат "ВЫБРАТЬ
	        |	РИБСОтборами.Ссылка
	        |ИЗ
	        |	ПланОбмена.РИБСОтборами КАК РИБСОтборами
			|ГДЕ НЕ РИБСОтборами.ЭтотУзел";
КонецФункции

// Возвращает массив с разделами проекта, которые указаны в шапке и в табличной части ссылки.
// Параметры:
//  ПроверяемаяСсылка - Произвольный - Ссылка на объект, из которого необходимо получить разделы проекта
// Возвращаемое значение:
//  Массив, содержит элементы типа СправочникСсылка.РазделыПроекта.
Функция МассивРазделовПроектаИзСсылки(ПроверяемаяСсылка) Экспорт
	МассивРазделов = Новый Массив;
	СведенияОРазделах = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроверяемаяСсылка, "РазделПроекта, РазделыПроекта");
	// Раздел проекта из шапки.
	Если ЗначениеЗаполнено(СведенияОРазделах.РазделПроекта) Тогда
		МассивРазделов.Добавить(СведенияОРазделах.РазделПроекта);
	КонецЕсли;
	// Разделы проекта из табличной части.
	Если СведенияОРазделах.РазделыПроекта <> Неопределено Тогда
		ВыборкаРазделов = СведенияОРазделах.РазделыПроекта.Выбрать();
		Пока ВыборкаРазделов.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаРазделов.Раздел) Тогда
				МассивРазделов.Добавить(ВыборкаРазделов.Раздел);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивРазделов;
КонецФункции

Функция ПроверятьПринадлежностьДопсвойстваПроекту(НаборСвойствСсылка) Экспорт
	Если НЕ ЗначениеЗаполнено(НаборСвойствСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивИсключенийНаборов = Новый Массив;
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ВерсииПроекта_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ТехническиеПроекты_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Идеи_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Ошибки_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ОбъектыМетаданных_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Подсистемы_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ФормыОбъектовМетаданных_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_МакетыОбъектовМетаданных_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КомандыОбъектовМетаданных_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_РазделыПроекта_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ЦелевыеЗадачи_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СборкиВерсии_Общие);
	МассивИсключенийНаборов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ЗадачиПроцесса_Общие);
	
	Если МассивИсключенийНаборов.Найти(НаборСвойствСсылка) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивНаборовСвязанныхСПроектами = Новый Массив;
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ВерсииПроекта);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Проекты);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ТехническиеПроекты);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Идеи);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Ошибки);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ОбъектыМетаданных);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Подсистемы);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ФормыОбъектовМетаданных);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_МакетыОбъектовМетаданных);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КомандыОбъектовМетаданных);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_РазделыПроекта);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ЦелевыеЗадачи);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СборкиВерсии);
	МассивНаборовСвязанныхСПроектами.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ЗадачиПроцесса);
	
	Если МассивНаборовСвязанныхСПроектами.Найти(НаборСвойствСсылка) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого ТекНаборСвойств Из МассивНаборовСвязанныхСПроектами Цикл
		Если НаборСвойствСсылка.ПринадлежитЭлементу(ТекНаборСвойств) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПараметрыДляОбработкиШаблонаПроцесса(ШаблонПроцесса) Экспорт
	ПараметрыДляОбработки = Новый Структура("Отказ, ТекстЗапроса", Ложь, "");
	Если ТипЗнч(ШаблонПроцесса) = Тип("Структура") Тогда
		ПредназначенДляОпределенногоТипаПредмета = ШаблонПроцесса.ПредназначенДляОпределенногоТипаПредмета;
		ТипПредметаСтрокой = ШаблонПроцесса.ТипПредмета;
	Иначе
		РеквизитыШаблонаПроцесса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШаблонПроцесса, "ПредназначенДляОпределенногоТипаПредмета, ТипПредмета, ЭтоГруппа");
		Если РеквизитыШаблонаПроцесса.ЭтоГруппа Тогда
			ПредназначенДляОпределенногоТипаПредмета = Ложь;
			ТипПредметаСтрокой = "";
		Иначе
			ПредназначенДляОпределенногоТипаПредмета = РеквизитыШаблонаПроцесса.ПредназначенДляОпределенногоТипаПредмета;
			ТипПредметаСтрокой = РеквизитыШаблонаПроцесса.ТипПредмета;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ПредназначенДляОпределенногоТипаПредмета
		Или НЕ ЗначениеЗаполнено(ТипПредметаСтрокой) Тогда
		Возврат ПараметрыДляОбработки;
	КонецЕсли;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Процессы"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПрофилиПользователей"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ОбъектыМетаданных"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ТехническиеПроекты"));

	// Преобразование полного имени "Справочник.<Имя>" в тип "СправочникСсылка.<Имя>"
	ТипПредмета = Тип(СтрЗаменить(ТипПредметаСтрокой, ".", "Ссылка."));
	Если МассивТипов.Найти(ТипПредмета) = Неопределено Тогда
		// Этот тип не мигрирует в РИБ.
		ПараметрыДляОбработки.Отказ = Истина;
	ИначеЕсли ТипПредмета = Тип("СправочникСсылка.ТехническиеПроекты") Тогда
		// Выгрузка шаблона зависит от того, выгружаются ли техпроекты.
		ПараметрыДляОбработки.ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РИБСОтборамиПроекты.Ссылка
			|ИЗ
			|	ПланОбмена.РИБСОтборами.Проекты КАК РИБСОтборамиПроекты
			|ГДЕ НЕ РИБСОтборамиПроекты.Ссылка.ЭтотУзел
			|	И РИБСОтборамиПроекты.СинхронизироватьТехническиеПроекты";
	КонецЕсли;
	Возврат ПараметрыДляОбработки;
КонецФункции

#КонецОбласти
